# IsReadOnlyFile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..IsReadOnlyFile Property
Document Class See Also
---
Signals whether the document was opened from a read-only file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsReadOnlyFile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsReadOnlyFile As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsReadOnlyFile {
	bool get ();
}
```

# Remarks
A document could be opened this way when, for example, at the time of opening the file was being used by another Revit user, or if the disk file has the read-only attribute set.
Although it will still be possible to modify the opened document, any changes made there will not be possible to save into the original file. If the changes are to be preserved, the document must be saved under a different name using the SaveAs() method.
# See Also
Document Class
Autodesk.Revit.DB Namespace